app/controllers/sitters_controller.rb

SELECT "sitters".* FROM "sitters"
---
  def index
    @sitters = Sitter.all

INSERT INTO "sitters" ("first_name", "last_name", "city", "state", "mobile_number", "rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @sitter = Sitter.new(sitter_params)

    respond_to do |format|
      if @sitter.save

SELECT  "sitters".* FROM "sitters" WHERE "sitters"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_sitter
      @sitter = Sitter.find(params[:id])